Repository: ntnglz/soilhue
Catalog: SoilHue/Resources/*.lproj/Localizable.strings
Languages: es

# export.error.invalid.format
source: Invalid export format
es: Formato de exportación no válido

# export.error.no.data
source: No data to export
es: No hay datos para exportar

# export.csv.header
source: ID,Date,Munsell Notation,Classification,Description,Calibrated,Correction Factors,Latitude,Longitude,Altitude,Address,Notes,Tags
es: ID,Fecha,Notación Munsell,Clasificación,Descripción,Calibrado,Factores de Corrección,Latitud,Longitud,Altitud,Dirección,Notas,Etiquetas

# common.yes
source: Yes
es: Sí

# calibration.quality.optimal
source: optimal
es: óptima

# calibration.quality.acceptable
source: acceptable
es: aceptable

# calibration.quality.poor
source: poor
es: pobre

# calibration.validation.result
source: Calibration validation: - Quality: %@ - Average error: %@ - Maximum error: %@ - Problematic colors: %@ - Device: %@
es: Validación de calibración: - Calidad: %@ - Error promedio: %@ - Error máximo: %@ - Colores problemáticos: %@ - Dispositivo: %@

# calibration.validation.no.problems
source: none
es: ninguno

# location.error.permission.denied
source: Location access is disabled. Please enable it in Settings.
es: El acceso a la ubicación está desactivado. Por favor, actívalo en Ajustes.

# location.error.invalid.device
source: Could not access device GPS.
es: No se pudo acceder al GPS del dispositivo.

# location.error.invalid.location
source: Could not get current location.
es: No se pudo obtener la ubicación actual.

# location.error.timeout
source: Timeout while getting location.
es: Tiempo de espera agotado al obtener la ubicación.

# location.error.unknown
source: Unknown error while getting location.
es: Error desconocido al obtener la ubicación.

# storage.error.save.image
source: Failed to save image
es: No se pudo guardar la imagen

# storage.error.save.analysis
source: Failed to save analysis
es: No se pudo guardar el análisis

# storage.error.load.analysis
source: Failed to load analysis
es: No se pudo cargar el análisis

# storage.error.analysis.not.found
source: Analysis not found
es: Análisis no encontrado

# storage.error.icloud.not.available
source: iCloud is not available
es: iCloud no está disponible

# storage.error.invalid.directory
source: Invalid storage directory
es: Directorio de almacenamiento no válido

# storage.error.directory.creation
source: Failed to create storage directory
es: No se pudo crear el directorio de almacenamiento

# storage.error.file.operation
source: File operation error: %@
es: Error en operación de archivo: %@

# soil.color.black
source: Black
es: Negro

# soil.color.very.dark.gray
source: Very Dark Gray
es: Gris muy oscuro

# soil.color.very.dark.brown
source: Very Dark Brown
es: Marrón muy oscuro

# soil.color.dark.brown
source: Dark Brown
es: Marrón oscuro

# soil.color.brown
source: Brown
es: Marrón

# soil.color.light.brown
source: Light Brown
es: Marrón claro

# soil.color.yellowish.brown
source: Yellowish Brown
es: Marrón amarillento

# soil.color.reddish.brown
source: Reddish Brown
es: Marrón rojizo

# soil.color.red
source: Red
es: Rojo

# soil.color.light.yellowish.brown
source: Light Yellowish Brown
es: Marrón amarillento claro

# soil.color.pale.yellow
source: Pale Yellow
es: Amarillo pálido

# soil.color.gray
source: Gray
es: Gris

# soil.color.light.gray
source: Light Gray
es: Gris claro

# soil.color.white
source: White
es: Blanco

# soil.color.light.brownish.gray
source: Light Brownish Gray
es: Gris parduzco claro

# soil.color.pale.brown
source: Pale Brown
es: Marrón pálido

# soil.classification.histosoles
source: Histosols
es: Histosoles

# soil.classification.mollisoles
source: Mollisols
es: Mollisoles

# soil.classification.alfisoles
source: Alfisols
es: Alfisoles

# soil.classification.oxisoles
source: Oxisols
es: Oxisoles

# soil.classification.vertisoles
source: Vertisols
es: Vertisoles

# soil.classification.espodosoles
source: Spodosols
es: Espodosoles

# soil.classification.aridisoles
source: Aridisols
es: Aridisoles

# soil.classification.entisoles
source: Entisols
es: Entisoles

# soil.classification.inceptisoles
source: Inceptisols
es: Inceptisoles

# soil.classification.ultisoles
source: Ultisols
es: Ultisoles

# soil.description.histosoles
source: Organic soil with high organic matter content, typical of peat soils and O horizons.
es: Suelo orgánico con alto contenido en materia orgánica, típico de suelos de turba y horizontes O.

# soil.description.mollisoles
source: Dark and fertile soil, rich in organic matter, typical of grasslands and A horizons.
es: Suelo oscuro y fértil, rico en materia orgánica, típico de praderas y horizontes A.

# soil.description.alfisoles
source: Soil with clay horizon, fertile, typical of forest regions and Bt horizons.
es: Suelo con horizonte de arcilla, fértil, típico de regiones forestales y horizontes Bt.

# soil.description.oxisoles
source: Highly weathered soil from tropical regions, with high content of iron and aluminum oxides.
es: Suelo muy meteorizado de regiones tropicales, con alto contenido en óxidos de hierro y aluminio.

# soil.description.vertisoles
source: Clay soil that cracks, with high content of expansive clay minerals.
es: Suelo arcilloso que se agrieta, con alto contenido en minerales arcillosos expansivos.

# soil.description.espodosoles
source: Acidic soil with accumulation of iron and aluminum, typical of humid forest regions.
es: Suelo ácido con acumulación de hierro y aluminio, típico de regiones forestales húmedas.

# soil.description.aridisoles
source: Soil from arid regions, with accumulation of salts and carbonates in the subsoil.
es: Suelo de regiones áridas, con acumulación de sales y carbonatos en el subsuelo.

# soil.description.entisoles
source: Young soil with little horizon development, typical of recent alluvial deposits.
es: Suelo joven con poco desarrollo de horizontes, típico de depósitos aluviales recientes.

# soil.description.inceptisoles
source: Slightly developed soil with incipient horizons, typical of mountainous regions.
es: Suelo poco desarrollado con horizontes incipientes, típico de regiones montañosas.

# soil.description.ultisoles
source: Acidic, highly weathered soil with clay horizon, typical of humid regions.
es: Suelo ácido, muy meteorizado, con horizonte de arcilla, típico de regiones húmedas.

# debug.location.decoding
source: DEBUG: Decoding location - lat: %f, lon: %f
es: DEBUG: Decodificando localización - lat: %f, lon: %f

# debug.location.not.found
source: DEBUG: No location information found in JSON
es: DEBUG: No se encontró información de localización en el JSON

# debug.location.encoding
source: DEBUG: Encoding location - lat: %f, lon: %f
es: DEBUG: Codificando localización - lat: %f, lon: %f

# debug.location.none
source: DEBUG: No location to encode
es: DEBUG: No hay localización para codificar
