Repository: ntnglz/soilhue
Catalog: SoilHue/Resources/*.lproj/Localizable.strings
Languages: es

source: Settings
es: Ajustes

source: Export
es: Exportar

source: Help
es: Ayuda

source: Camera
es: Cámara

source: Analysis
es: Análisis

source: Calibration
es: Calibración

# welcome.title
source: Welcome to SoilHue
es: Bienvenido a SoilHue

# welcome.description
source: Analyze soil color accurately and get its Munsell classification
es: Analiza el color del suelo de manera precisa y obtén su clasificación Munsell

# location.status.enabled
source: Location enabled
es: Ubicación activada

# location.status.disabled
source: Location disabled
es: Ubicación desactivada

# calibration.guide.align
source: Align the calibration card with the rectangle
es: Alinee la tarjeta de calibración con el rectángulo

# calibration.guide.frame
source: Align the calibration card within the frame
es: Alinea la tarjeta de calibración dentro del marco

# calibration.status.notCalibrated
source: Not calibrated
es: No calibrado

# calibration.status.calibrating
source: Calibrating...
es: Calibrando...

# calibration.status.calibrated
source: Calibrated
es: Calibrado

# calibration.button.takePhoto
source: Take Photo
es: Tomar Foto

# calibration.button.selectPhoto
source: Select
es: Seleccionar

# calibration.button.close
source: Close
es: Cerrar

# calibration.error.generic
source: Error generating calibration card
es: Error al generar la tarjeta de calibración

# calibration.success.title
source: Calibration Successful
es: Calibración Exitosa

# calibration.success.message
source: The camera has been calibrated successfully.
es: La cámara ha sido calibrada correctamente.

# calibration.info.title
source: Calibration Card
es: Tarjeta de Calibración

# calibration.info.description
source: It is recommended to use the X-Rite ColorChecker Classic with 24 patches for accurate results.
es: Se recomienda usar el X-Rite ColorChecker Classic con 24 parches para obtener resultados precisos.

# calibration.info.features.title
source: Features:
es: Características:

# calibration.info.features.certified
source: • Certified and stable colors
es: • Colores certificados y estables

# calibration.info.features.resistant
source: • UV resistant
es: • Resistente a UV

# calibration.info.features.patches
source: • 24 specific color patches
es: • 24 parches de color específicos

# calibration.info.features.values
source: • Accurate sRGB reference values
es: • Valores de referencia sRGB precisos

# calibration.alternative.title
source: Alternative for Hobbyists
es: Alternativa para Aficionados

# calibration.alternative.description
source: If you don't have access to a professional card, you can use our basic calibration card.
es: Si no tienes acceso a una tarjeta profesional, puedes usar nuestra tarjeta básica de calibración.

# calibration.alternative.download
source: Download Basic Card
es: Descargar Tarjeta Básica

# calibration.alternative.note
source: Note: The basic card provides approximate calibration. For professional results, using the certified ColorChecker is recommended.
es: Nota: La tarjeta básica proporciona una calibración aproximada. Para resultados profesionales, se recomienda usar el ColorChecker certificado.

# feature.capture.title
source: Precise Capture
es: Captura Precisa

# feature.analysis.title
source: Munsell Analysis
es: Análisis Munsell

# feature.classification.title
source: Soil Classification
es: Clasificación de Suelos

# button.gallery
source: Gallery
es: Galería

# button.camera
source: Camera
es: Cámara

# button.calibrate
source: Calibrate Camera
es: Calibrar Cámara

# button.export
source: Export
es: Exportar

# button.settings
source: Settings
es: Ajustes

# button.help
source: Help
es: Ayuda

# button.ok
source: OK
es: Aceptar

source: Take Photo
es: Tomar Foto

source: Select Photo
es: Seleccionar Foto

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Close
es: Cerrar

source: Done
es: Hecho

source: Next
es: Siguiente

source: Back
es: Atrás

source: More Info
es: Más Información

source: New Sample
es: Nueva Muestra

# button.close
source: Close
es: Cerrar

source: Munsell Notation
es: Notación Munsell

source: Soil Classification
es: Clasificación del Suelo

source: Description
es: Descripción

source: Location
es: Ubicación

source: Notes
es: Notas

source: Tags
es: Etiquetas

source: Calibration Status
es: Estado de Calibración

source: Calibrated
es: Calibrado

source: Not Calibrated
es: No Calibrado

source: Calibrating...
es: Calibrando...

source: Calibration Error
es: Error de Calibración

source: Camera Resolution
es: Resolución de Cámara

source: Storage Location
es: Ubicación de Almacenamiento

source: Auto Calibration
es: Calibración Automática

source: Dark Mode
es: Modo Oscuro

source: Export Format
es: Formato de Exportación

source: Reset to Defaults
es: Restaurar Valores por Defecto

source: Low (720p)
es: Baja (720p)

source: Medium (1080p)
es: Media (1080p)

source: High (4K)
es: Alta (4K)

source: Local Storage
es: Almacenamiento Local

source: Light
es: Claro

source: Dark
es: Oscuro

source: System
es: Sistema

# export.format.csv.description
source: Simple comma-separated text format. Compatible with Excel, Numbers, and other spreadsheets.
es: Formato de texto simple separado por comas. Compatible con Excel, Numbers y otras hojas de cálculo.

# export.format.json.description
source: Structured format ideal for data processing and development.
es: Formato estructurado ideal para procesamiento de datos y desarrollo.

source: Camera Error
es: Error de Cámara

source: Storage Error
es: Error de Almacenamiento

source: Export Error
es: Error de Exportación

source: Location Error
es: Error de Ubicación

source: No camera access
es: Sin acceso a la cámara

source: No location access
es: Sin acceso a la ubicación

source: Failed to save image
es: Error al guardar la imagen

source: Failed to load image
es: Error al cargar la imagen

source: Failed to export data
es: Error al exportar los datos

source: No data to export
es: No hay datos para exportar

source: Camera Access Required
es: Acceso a Cámara Requerido

source: Location Access Required
es: Acceso a Ubicación Requerido

source: Camera permission is required to capture soil samples.
es: Se requiere permiso de cámara para capturar muestras de suelo.

source: Location permission is required to record where samples were taken.
es: Se requiere permiso de ubicación para registrar dónde se tomaron las muestras.

source: Open Settings
es: Abrir Ajustes

source: Start Calibration
es: Iniciar Calibración

source: Calibration Complete
es: Calibración Completada

source: Calibration Failed
es: Calibración Fallida

source: Please calibrate the camera before taking samples.
es: Por favor, calibre la cámara antes de tomar muestras.

source: Calibration card not detected
es: Tarjeta de calibración no detectada

source: Position the calibration card in the frame
es: Posicione la tarjeta de calibración en el marco

source: Analyzing sample...
es: Analizando muestra...

source: Analysis complete
es: Análisis completado

source: Analysis failed
es: Análisis fallido

source: Save Sample
es: Guardar Muestra

source: Sample saved successfully
es: Muestra guardada correctamente

source: Failed to save sample
es: Error al guardar la muestra

# analysis.area.selected
source: Selected area: %d%% x %d%%
es: Área seleccionada: %d%% x %d%%

# analysis.drag.select
source: Drag to select an area or tap Analyze to process the entire image
es: Arrastra para seleccionar un área

source: Export Data
es: Exportar Datos

source: Export Complete
es: Exportación Completada

source: Export Failed
es: Exportación Fallida

source: Exporting...
es: Exportando...

source: Share
es: Compartir

source: Version
es: Versión

source: About
es: Acerca de

source: Help & Support
es: Ayuda y Soporte

source: Privacy Policy
es: Política de Privacidad

source: Terms of Use
es: Términos de Uso

# help.title
source: Help
es: Ayuda

# help.section
source: Section
es: Sección

# help.section.soils
source: Soils
es: Suelos

# help.section.horizons
source: Horizons
es: Horizontes

# help.general.what.title
source: What is SoilHue?
es: ¿Qué es SoilHue?

# help.general.what.content
source: SoilHue is an application designed to assist in soil color classification and analysis using the Munsell system, an international standard for color description.
es: SoilHue es una aplicación diseñada para ayudar en la clasificación y análisis del color del suelo utilizando el sistema Munsell, un estándar internacional para la descripción del color.

# help.general.how.title
source: How does it work?
es: ¿Cómo funciona?

# help.general.how.content
source: 1. Take a photo of the soil or select an existing one 2. Select the specific area to analyze 3. Get the Munsell color and soil classification
es: 1. Toma una foto del suelo o selecciona una existente 2. Selecciona el área específica a analizar 3. Obtén el color Munsell y la clasificación del suelo

# help.general.tips.title
source: Tips for better results
es: Consejos para mejores resultados

# help.general.tips.content
source: • Take photos in natural light • Avoid shadows and reflections • Keep the sample clean and dry • Use a flat surface
es: • Toma fotos con luz natural • Evita sombras y reflejos • Mantén la muestra limpia y seca • Usa una superficie plana

# help.general.munsell.title
source: Munsell System
es: Sistema Munsell

# help.general.munsell.content
source: The Munsell system describes color using three components: • Hue: the base color • Value: the lightness • Chroma: the saturation
es: El sistema Munsell describe el color usando tres componentes: • Matiz: el color base • Valor: la luminosidad • Croma: la saturación

# help.soils.types.title
source: Main Soil Types
es: Tipos Principales de Suelos

# help.soils.types.content
source: • Entisols: Young soils with little horizon development • Inceptisols: Slightly developed soils with incipient horizons • Mollisols: Dark, fertile soils rich in organic matter • Alfisols: Clay-rich horizon soils, fertile • Ultisols: Acidic, highly weathered soils • Oxisols: Highly weathered tropical soils • Vertisols: Cracking clay soils • Aridisols: Soils of arid regions • Spodosols: Acidic soils with iron accumulation • Histosols: Organic soils (peat)
es: • Entisoles: Suelos jóvenes con poco desarrollo de horizontes • Inceptisoles: Suelos poco desarrollados con horizontes incipientes • Molisoles: Suelos oscuros y fértiles ricos en materia orgánica • Alfisoles: Suelos con horizonte rico en arcilla, fértiles • Ultisoles: Suelos ácidos muy meteorizados • Oxisoles: Suelos tropicales muy meteorizados • Vertisoles: Suelos arcillosos que se agrietan • Aridisoles: Suelos de regiones áridas • Spodosoles: Suelos ácidos con acumulación de hierro • Histosoles: Suelos orgánicos (turba)

# help.soils.color.title
source: Color Characteristics
es: Características del Color

# help.soils.color.content
source: • Red: Indicates presence of iron oxides, good aeration • Yellow: Presence of hydrated iron oxides • Gray: Reduction conditions, poor drainage • Black/Dark Brown: High organic matter content • White: Presence of carbonates, salts, or silica
es: • Rojo: Indica presencia de óxidos de hierro, buena aireación • Amarillo: Presencia de óxidos de hierro hidratados • Gris: Condiciones de reducción, mal drenaje • Negro/Marrón Oscuro: Alto contenido de materia orgánica • Blanco: Presencia de carbonatos, sales o sílice

# help.soils.factors.title
source: Influencing Factors
es: Factores Influyentes

# help.soils.factors.content
source: • Organic matter • Present minerals • Moisture content • Oxidation degree • Biological activity
es: • Materia orgánica • Minerales presentes • Contenido de humedad • Grado de oxidación • Actividad biológica

# help.horizons.main.title
source: Main Horizons
es: Horizontes Principales

# help.horizons.main.content
source: • O - Organic horizon: Decomposing plant remains • A - Surface mineral horizon: Rich in organic matter • E - Eluviation horizon: Loss of materials by leaching • B - Illuviation horizon: Accumulation of materials • C - Parent material: Slightly altered bedrock • R - Bedrock: Unaltered original material
es: • O - Horizonte orgánico: Restos vegetales en descomposición • A - Horizonte mineral superficial: Rico en materia orgánica • E - Horizonte de eluviación: Pérdida de materiales por lixiviación • B - Horizonte de iluviación: Acumulación de materiales • C - Material parental: Roca madre poco alterada • R - Roca madre: Material original inalterado

# help.horizons.a.title
source: A Horizon
es: Horizonte A

# help.horizons.a.content
source: • A1: Highest organic matter content • A2: Transition, less organic matter • A3: Transition to B horizon Characteristics: • Dark color from organic matter • High biological activity • Good soil structure
es: • A1: Mayor contenido de materia orgánica • A2: Transición, menos materia orgánica • A3: Transición al horizonte B Características: • Color oscuro por materia orgánica • Alta actividad biológica • Buena estructura del suelo

# help.horizons.b.title
source: B Horizon
es: Horizonte B

# help.horizons.b.content
source: • Bt: Clay accumulation • Bs: Sesquioxide accumulation • Bh: Humus accumulation • Bk: Carbonate accumulation Characteristics: • Greater structural development • More intense colors • Lower organic content
es: • Bt: Acumulación de arcilla • Bs: Acumulación de sesquióxidos • Bh: Acumulación de humus • Bk: Acumulación de carbonatos Características: • Mayor desarrollo estructural • Colores más intensos • Menor contenido orgánico

# help.horizons.color.title
source: Color Importance
es: Importancia del Color

# help.horizons.color.content
source: Color is an important indicator of: • Organic matter content • Drainage conditions • Oxidation-reduction processes • Presence of specific minerals • Soil development history
es: El color es un indicador importante de: • Contenido de materia orgánica • Condiciones de drenaje • Procesos de oxidación-reducción • Presencia de minerales específicos • Historia del desarrollo del suelo

# analysis.results.title
source: Analysis Results
es: Resultados del Análisis

# analysis.munsell.color
source: Munsell Color
es: Color Munsell

# analysis.classification
source: Classification
es: Clasificación

# analysis.description
source: Description
es: Descripción

# analysis.save
source: Save Analysis
es: Guardar Análisis

# analysis.more.info
source: More Information
es: Más Infor- mación

# analysis.new.sample
source: New Sample
es: Nueva Mues- tra

# analysis.location
source: Location
es: Ubicación

# analysis.latitude
source: Latitude: %.6f°
es: Latitud: %.6f°

# analysis.longitude
source: Longitude: %.6f°
es: Longitud: %.6f°

# analysis.altitude
source: Altitude: %.1f m
es: Altitud: %.1f m

# analysis.accuracy
source: Accuracy: %.1f m
es: Precisión: %.1f m

# analysis.analyze.color
source: Analyze Color
es: Analizar Color

# analysis.success
source: Success
es: Éxito

# analysis.saved
source: Analysis saved successfully
es: Análisis guardado correctamente

# analysis.calibrate.now
source: Calibrate now
es: Calibrar ahora

# selection.mode.rectangle
source: Rectangle
es: Rectángulo

# selection.mode.polygon
source: Polygon
es: Polígono

# selection.polygon.vertices
source: Polygon with %d vertices
es: Polígono con %d vértices

# selection.polygon.instruction
source: Tap to add polygon vertices
es: Toca para añadir vértices del polígono

# selection.polygon.complete
source: Double tap to complete the polygon
es: Doble toque para completar el polígono

# analysis.button.analyze
source: Analyze Color
es: Analizar Color

# analysis.analyzing
source: Analyzing...
es: Analizando...

# location.title
source: Location
es: Ubicación

# location.marker
source: Location
es: Ubicación

# onboarding.button.previous
source: Previous
es: Anterior

# onboarding.button.next
source: Next
es: Siguiente

# onboarding.button.start
source: Get Started
es: Comenzar

# onboarding.step1.title
source: Welcome to SoilHue
es: Bienvenido a SoilHue

# onboarding.step1.description
source: Discover the color and characteristics of your soil samples accurately and easily.
es: Descubre el color y las características de tus muestras de suelo de forma precisa y sencilla.

# onboarding.step2.title
source: Calibration
es: Calibración

# onboarding.step2.description
source: Before starting, calibrate the camera using the color card. This will ensure accurate results.
es: Antes de empezar, calibra la cámara usando la tarjeta de color. Esto asegurará resultados precisos.

# onboarding.step3.title
source: Sample Capture
es: Captura de Muestras

# onboarding.step3.description
source: Take photos of your soil samples or select existing images from your gallery.
es: Toma fotos de tus muestras de suelo o selecciona imágenes existentes de tu galería.

# onboarding.step4.title
source: Ready to Start!
es: ¡Listo para Empezar!

# onboarding.step4.description
source: You're now ready to analyze your soil samples. Shall we begin?
es: Ya estás preparado para analizar tus muestras de suelo. ¿Comenzamos?

# sample.details.title
source: Sample Details
es: Detalles de la Muestra

# sample.analyze
source: Analyze Sample
es: Analizar Muestra

# sample.analyzing
source: Analyzing...
es: Analizando...

# sample.munsell.title
source: Munsell Color
es: Color Munsell

# sample.not.analyzed
source: Not analyzed
es: No analizado

# sample.classification.title
source: Soil Classification
es: Clasificación del Suelo

# sample.description.title
source: Description
es: Descripción

# sample.location.title
source: Location
es: Ubicación

# sample.latitude.format
source: Latitude: %.6f
es: Latitud: %.6f

# sample.longitude.format
source: Longitude: %.6f
es: Longitud: %.6f

# sample.date.title
source: Sampling Date
es: Fecha de Muestreo

# preview.soil.classification
source: Clay soil
es: Suelo arcilloso

# preview.soil.description
source: Soil with high clay content, dark brown color
es: Suelo con alto contenido de arcilla, color pardo oscuro

# feature.capture.description
source: Capture soil samples with precision using the camera or selecting existing images
es: Captura muestras de suelo con precisión utilizando la cámara o seleccionando imágenes existentes

# feature.analysis.description
source: Analyze soil color using the Munsell system for accurate classification
es: Analiza el color del suelo utilizando el sistema Munsell para una clasificación precisa

# feature.classification.description
source: Classify soil based on its characteristics and get detailed information about its composition
es: Clasifica el suelo según sus características y obtén información detallada sobre su composición

# analysis.notes
source: Notes
es: Notas

# analysis.tags
source: Tags
es: Etiquetas

# analysis.tags.placeholder
source: Separated by commas
es: Separadas por comas

# analysis.save.title
source: Save Analysis
es: Guardar Análisis

source: Cancel
es: Cancelar

source: Save
es: Guardar

# calibration.card.title
source: Basic Calibration Card
es: Tarjeta de Calibración Básica

# calibration.card.instructions.title
source: Usage Instructions:
es: Instrucciones de uso:

# calibration.card.instructions.print
source: 1. Print this card on a quality printer
es: 1. Imprime esta tarjeta en una impresora de calidad

# calibration.card.instructions.colors
source: 2. Ensure colors are printed correctly
es: 2. Asegúrate de que los colores se impriman correctamente

# calibration.card.instructions.placement
source: 3. Place the card on a flat surface
es: 3. Coloca la tarjeta sobre una superficie plana

# calibration.card.instructions.lighting
source: 4. Avoid shadows and reflections
es: 4. Evita sombras y reflejos

# calibration.card.instructions.parallel
source: 5. Keep the card parallel to the camera when taking the photo
es: 5. Mantén la tarjeta paralela a la cámara al tomar la foto

# calibration.card.note
source: Note: This basic card provides approximate calibration.
es: Nota: Esta tarjeta básica proporciona una calibración aproximada.

# calibration.card.recommendation
source: For professional results, using the X-Rite ColorChecker Classic is recommended.
es: Para resultados profesionales, se recomienda usar el X-Rite ColorChecker Classic.

# calibration.patch.dark.skin
source: Dark skin
es: Piel oscura

# calibration.patch.light.skin
source: Light skin
es: Piel clara

# calibration.patch.blue.sky
source: Blue sky
es: Cielo azul

# calibration.patch.foliage
source: Foliage
es: Follaje

# calibration.patch.blue.flower
source: Blue flower
es: Flor azul

# calibration.patch.bluish.green
source: Bluish green
es: Verde azulado

# calibration.patch.orange
source: Orange
es: Naranja

# calibration.patch.purplish.blue
source: Purplish blue
es: Azul púrpura

# calibration.patch.moderate.red
source: Moderate red
es: Rojo moderado

# calibration.patch.purple
source: Purple
es: Púrpura

# calibration.patch.yellow.green
source: Yellow green
es: Verde amarillo

# calibration.patch.orange.yellow
source: Orange yellow
es: Amarillo naranja

# calibration.patch.blue
source: Blue
es: Azul

# calibration.patch.green
source: Green
es: Verde

# calibration.patch.red
source: Red
es: Rojo

# calibration.patch.yellow
source: Yellow
es: Amarillo

# calibration.patch.cyan
source: Cyan
es: Cian

# calibration.patch.white
source: White
es: Blanco

# calibration.patch.black
source: Black
es: Negro

# calibration.error.image.processing
source: Could not process the image
es: No se pudo procesar la imagen

# calibration.error.insufficient.patches
source: Could not detect enough color patches
es: No se pudieron detectar suficientes parches de color

# calibration.log.start
source: Starting calibration processing...
es: Iniciando procesamiento de calibración...

# calibration.log.dimensions
source: Image dimensions: %.0fx%.0f
es: Dimensiones de la imagen: %.0fx%.0f

# calibration.log.patch
source: Processing patch %@:
es: Procesando parche %@:

# calibration.log.reference
source: Reference: R=%.3f, G=%.3f, B=%.3f
es: Referencia: R=%.3f, G=%.3f, B=%.3f

# calibration.log.measured
source: Measured: R=%.3f, G=%.3f, B=%.3f
es: Medido: R=%.3f, G=%.3f, B=%.3f

# calibration.log.factors
source: Factors: R=%.3f, G=%.3f, B=%.3f
es: Factores: R=%.3f, G=%.3f, B=%.3f

# calibration.log.valid.patches
source: Total valid patches: %d
es: Total de parches válidos: %d

# camera.error.permission.denied
source: No camera access. Please check permissions in Settings.
es: No hay acceso a la cámara. Por favor, verifica los permisos en Ajustes.

# camera.error.capture
source: Error capturing photo.
es: Error al capturar la foto.

# camera.error.invalid.device
source: Could not access device camera.
es: No se pudo acceder a la cámara del dispositivo.

# camera.error.configuration
source: Error configuring camera.
es: Error al configurar la cámara.

# camera.error.session.not.running
source: Camera session is not active.
es: La sesión de la cámara no está activa.

# camera.error.resolution.not.supported
source: Selected resolution is not supported by this device.
es: La resolución seleccionada no está soportada por este dispositivo.

# camera.error.invalid.resolution
source: Could not set desired resolution.
es: No se pudo configurar la resolución deseada.

# camera.error.no.permission
source: No permission to access camera.
es: No hay permiso para acceder a la cámara.

# camera.error.setup.failed
source: Error setting up camera.
es: Error al configurar la cámara.

# color.analysis.error.not.calibrated
source: Camera is not calibrated. Please calibrate before analyzing images.
es: La cámara no está calibrada. Por favor, realice la calibración antes de analizar imágenes.

# export.error.create.file
source: Failed to create export file
es: No se pudo crear el archivo de exportación

# export.error.write.data
source: Error writing data
es: Error al escribir los datos
